<script>
import { where } from 'firebase/firestore'
import EditMode from '~/components/mixins/EditMode'
/**
 * ### GMembers
 * defaultスロットのみを保有し、data-tableまたはdata-iteratorがスロットに
 * 配置されることを想定したコンポーネントです。
 *
 */
export default {
  /***************************************************************************
   * MIXINS
   ***************************************************************************/
  mixins: [EditMode],
  /***************************************************************************
   * PROPS
   ***************************************************************************/
  props: {
    companyId: { type: String, default: undefined, required: false },
  },
  /***************************************************************************
   * DATA
   ***************************************************************************/
  data() {
    return {
      items: [],
      model: this.$Member(),
    }
  },
  /***************************************************************************
   * WATCH
   ***************************************************************************/
  watch: {
    companyId: {
      handler(v) {
        this.subscribe()
      },
      immediate: true,
    },
  },
  /***************************************************************************
   * DESTROYED
   ***************************************************************************/
  destroyed() {
    this.model.unsubscribe()
  },
  /***************************************************************************
   * METHODS
   ***************************************************************************/
  methods: {
    async submit() {},
    subscribe() {
      const constraints = this.companyId
        ? [where('companyId', '==', this.companyId)]
        : []
      this.items = this.model.subscribe(undefined, constraints)
    },
  },
  /***************************************************************************
   * RENDER
   ***************************************************************************/
  render() {
    return this.$scopedSlots.default({ items: this.items })
  },
}
</script>
